from tkinter import Y


# x+y 더하기

# x-y 빼기

# x*y 곱하기

# x/y 나누니

# x//y x를 나눈 몫

# x%y x를 y로 나눈 나머지

# x**y x의 y제곱

# x*(y+z) y와 z를 더한 뒤 곱하기 x


# 위에서 아래로 갈수록 우선순위가 높다
# 우선순위가 높다는 것은 아래에 있는 유형의 식부터 계산을 한다는 것이다

# 계산식을 적을때 소괄호를 사용하는편이 좋다
# 그리고 계산식을 적을때 기호를 띄워쓰기를 사용할수도 사용하지 않을수도 있다


# 연산 기호
# x =+ y       x = x + y
# x -= y       x = x - y
# x *= y       x = x * y
# x /= y       x = x / y
# x //= y      x = x // y
# x %= y       x = x % y

# 왼쪽의 식은 오른쪽의 식을 나타내는 것이다

# int(a)      int는 문자열로 들어가있는 a를 숫자와 같은 형태의 데이터를 정수로 바꿈
# 예를 들어 숫자 7을 100번 곱하여 700이 나와야 하는데 7이 100번 찍히는 상황을 자신이 원하는 값이 나오도록 도와줌


# str(a)       str은 int와 반대되는 것으로 숫자를 문자열로 변경한다